ExchangePlans/ОбменССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<ExchangePlan>
		<Properties>
			<Name>ОбменССайтом</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>B2B_РегламентноеЗадание</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B2B_Портал</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.B2B_Портал</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B2B_ОбменJSON</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B2B_FTPДляВыгрузкиКартинок</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B2B_FTPДляВыгрузкиКартинокЛогин</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B2B_FTPДляВыгрузкиКартинокПароль</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>B2B_АдресЛогаЗапроса</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКаталога</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменТоварами</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменЗаказами</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ExchangePlans/ОбменССайтом/Forms/ФормаУзла/Ext/Form/Module.bsl
&Вместо("ПриСозданииНаСервере")
Процедура B2B_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УзелОбменаЭтаИБ = ПроверитьУзелОбменаЭтаИБСервер();
	
	Если УзелОбменаЭтаИБ Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриСозданииЧтенииНаСервере(ЭтотОбъект, Объект);
	Иначе
		
		УстановитьПривилегированныйРежим(Истина);
		ПарольИзХранилища = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка, "Пароль");
		УстановитьПривилегированныйРежим(Ложь);
		Пароль = ?(ЗначениеЗаполнено(ПарольИзХранилища), ЭтотОбъект.УникальныйИдентификатор, "");
		
	КонецЕсли;
	
	Если Не Объект.ВыгружатьОбновленияЦенИОстатков Тогда
		РежимВыгрузкиЦен = 1;
	КонецЕсли;
	
	ЭтотОбъект.ФормаРедактируется = Истина;
	
	ОбменССайтомПереопределяемый.ФормаУзлаПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);  

	//B2B
	
	ПолеВвода = Элементы.Добавить("B2B_ОбменJSON",Тип("ПолеФормы"),Элементы.СтраницаВыгрузкаНаСайт);
	ПолеВвода.Заголовок = "Прямой обмен с сайтом через JSON запрос";
	ПолеВвода.Вид = ВидПоляФормы.ПолеФлажка;
	ПолеВвода.ПутьКДанным = "Объект.B2B_ОбменJSON";	        
	
	ПолеВвода.УстановитьДействие("ПриИзменении", "ПоменялиГалку");
	
	ПолеВвода = Элементы.Добавить("B2B_Портал",Тип("ПолеФормы"),Элементы.СтраницаВыгрузкаНаСайт);
	ПолеВвода.Заголовок = "B2B_Портал";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.B2B_Портал";     
	
	ПолеВвода = Элементы.Добавить("B2B_АдресЛогаЗапроса",Тип("ПолеФормы"),Элементы.СтраницаВыгрузкаНаСайт);
	ПолеВвода.Заголовок = "Отправить лог в Telegram пользователю";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.B2B_АдресЛогаЗапроса";	
	
	//--------
	ПолеВвода = Элементы.Добавить("B2B_FTPДляВыгрузкиКартинок",Тип("ПолеФормы"),Элементы.СтраницаВыгрузкаНаСайт);
	ПолеВвода.Заголовок = "FTP для выгрузки картинок";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.B2B_FTPДляВыгрузкиКартинок";	    
	
	//--------
	ПолеВвода = Элементы.Добавить("B2B_FTPДляВыгрузкиКартинокЛогин",Тип("ПолеФормы"),Элементы.СтраницаВыгрузкаНаСайт);
	ПолеВвода.Заголовок = "FTP логин";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.B2B_FTPДляВыгрузкиКартинокЛогин";	    
	
	//--------
	ПолеВвода = Элементы.Добавить("B2B_FTPДляВыгрузкиКартинокПароль",Тип("ПолеФормы"),Элементы.СтраницаВыгрузкаНаСайт);
	ПолеВвода.Заголовок = "FTP пароль";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода; 
	ПолеВвода.РежимПароля = Истина;
	ПолеВвода.ПутьКДанным = "Объект.B2B_FTPДляВыгрузкиКартинокПароль";	    
	
	//--------
	
	
КонецПроцедуры      

&НаКлиенте
Процедура ПоменялиГалку(Элемент)
	
	Элементы.B2B_Портал.Видимость = Объект.B2B_ОбменJSON;
	Элементы.B2B_АдресЛогаЗапроса.Видимость = Объект.B2B_ОбменJSON;
	Элементы.B2B_FTPДляВыгрузкиКартинок.Видимость = Объект.B2B_ОбменJSON;
	Элементы.B2B_FTPДляВыгрузкиКартинокЛогин.Видимость = Объект.B2B_ОбменJSON;
	Элементы.B2B_FTPДляВыгрузкиКартинокПароль.Видимость = Объект.B2B_ОбменJSON;

КонецПроцедуры
